Insert Into Profession(pid, pname, academy) Values
("000","未定","少年班学院"),
("045","数学与应用数学","数学科学学院"),
("046","信息与计算科学","数学科学学院"),
("006","电子信息工程","信息科学技术学院"),
("010","自动化","信息科学技术学院"),
("026","人工智能","信息科学技术学院"),
("011","计算机科学与技术","计算机科学与技术学院"),
("219","电子科学与技术","微电子学院"),
("221","网络空间安全","网络空间安全学院"),
("229","数据科学与大数据技术","人工智能与数据科学学院")
;

Insert Into Course(cid, cname, credit, type) Values
("CS1001A","计算机程序设计A",4,"必修"),
("CS1002A","计算系统概论A",4,"必修"),
("MATH1006","数学分析B1",6,"必修"),
("MATH1007","数学分析B2",6,"必修"),
("MATH1009","线性代数B",4,"必修"),
("011147","数据库系统及应用",3.5,"必修"),
("017144","随机过程B",2,"选修"),
("011170","并行计算",2.5,"选修"),
("MARX1004","毛泽东思想和中国特色社会主义理论体系概论",3,"必修"),
("COMM1507","电子信息检索",2,"通识"),
("PE00116","网球II",1,"体育")
;

Insert Into Student(sid, sname, sex, getdate, pid, phone, email) Values
("PB21111681","朱炜荣","男","2021-09-01","011","13913913939","zwr211355@mail.ustc.edu.cn"),
("SA20000001","王python","男","2020-09-01","000",NULL,NULL),
("SB22191958","奇利亚斯","女","2019-06-01","219",11111111111,"1@g.com")
;

Insert Into SC(sid, cid, score) Values
("PB21111681","MATH1007",83),
("PB21111681","PE00116",78),
("SB22191958","MARX1004",95),
("SB22191958","CS1002A",100),
("SA20000001","011147",59),
("SA20000001","MATH1006",NULL)
;

Insert Into Info(sid, type, infomation) Values
("SA20000001","警告","存在挂科现象")
;
